
## Plan Result (stg)




<pre><code>Plan: 3 to add, 11 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.sc_team_members_voda_contrib
  * azurerm_role_assignment.sc_team_members_voda_data_contrib
  * azurerm_role_assignment.sc_team_members_voda_readers
* Update
  * azurerm_key_vault_secret.appinsights-key
  * azurerm_key_vault_secret.appinsights_connection_string
  * azurerm_key_vault_secret.edit_password[0]
  * azurerm_key_vault_secret.finalsa_storage_account_connection_string
  * azurerm_key_vault_secret.finalsa_storage_account_primary_access_key
  * azurerm_key_vault_secret.ingestsa_storage_account_connection_string
  * azurerm_key_vault_secret.sa_storage_account_connection_string
  * azurerm_key_vault_secret.vodasa_storage_account_connection_string
  * azurerm_key_vault_secret.vodasa_storage_account_primary_access_key
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.appinsights-key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "appinsights-key" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-stg.vault.azure.net/secrets/AppInsightsInstrumentationKey/3824fbfd9e37439f8a0c156c018cc549"
        name                    = "AppInsightsInstrumentationKey"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.appinsights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "appinsights_connection_string" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-stg.vault.azure.net/secrets/app-insights-connection-string/2de0b698475e48dd8db173462d6a2a0d"
        name                    = "app-insights-connection-string"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.edit_password[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "edit_password" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-stg.vault.azure.net/secrets/videditvm1-password/0ae17c91742c474d96854bbc0491094b"
        name                    = "videditvm1-password"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.finalsa_storage_account_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "finalsa_storage_account_connection_string" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-stg.vault.azure.net/secrets/finalsa-storage-account-connection-string/6d909ecece734fa682459d1219e704bc"
        name                    = "finalsa-storage-account-connection-string"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.finalsa_storage_account_primary_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "finalsa_storage_account_primary_access_key" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-stg.vault.azure.net/secrets/finalsa-storage-account-primary-access-key/68e532850fa4406cb79cc4bc1d5a1951"
        name                    = "finalsa-storage-account-primary-access-key"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.ingestsa_storage_account_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "ingestsa_storage_account_connection_string" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-stg.vault.azure.net/secrets/ingestsa-storage-account-connection-string/16fcb0182bb54d8487b81341a2a07840"
        name                    = "ingestsa-storage-account-connection-string"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sa_storage_account_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sa_storage_account_connection_string" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-stg.vault.azure.net/secrets/sa-storage-account-connection-string/0ebade2d395b4521bff89285049f9058"
        name                    = "sa-storage-account-connection-string"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.vodasa_storage_account_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "vodasa_storage_account_connection_string" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-stg.vault.azure.net/secrets/vodasa-storage-account-connection-string/68813fe6443341acb63b19542485dcae"
        name                    = "vodasa-storage-account-connection-string"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.vodasa_storage_account_primary_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "vodasa_storage_account_primary_access_key" {
      - expiration_date         = "2026-06-01T01:00:00Z" -> null
        id                      = "https://pre-hmctskv-stg.vault.azure.net/secrets/vodasa-storage-account-primary-access-key/12b9920e922b4f498c20a84f77727575"
        name                    = "vodasa-storage-account-primary-access-key"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_role_assignment.sc_team_members_voda_contrib will be created
  + resource "azurerm_role_assignment" "sc_team_members_voda_contrib" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "96a51158-459c-4ded-8360-db33af2de2f0"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prevodasastg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.sc_team_members_voda_data_contrib will be created
  + resource "azurerm_role_assignment" "sc_team_members_voda_data_contrib" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "96a51158-459c-4ded-8360-db33af2de2f0"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prevodasastg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.sc_team_members_voda_readers will be created
  + resource "azurerm_role_assignment" "sc_team_members_voda_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "96a51158-459c-4ded-8360-db33af2de2f0"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prevodasastg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
        name                               = "prefinalsastg"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
        name                               = "preingestsastg"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 11 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1011,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->